// Mock Data for School Calendar - Обновлено из расписания 2025-2026

export const SUBJECTS = [
    "Алгебра",
    "Английский язык",
    "Биология",
    "География",
    "Геометрия",
    "Информатика",
    "История",
    "Литература",
    "Обществознание",
    "Продленка",
    "Русский язык",
    "С 3.10",
    "С 7.10",
    "Со 2.10",
    "Сонаcтройка Гайденко",
    "Сонаcтройка Тенешева",
    "Сонастройка",
    "Сонастройка Ларшина",
    "Сонастройка Ларшина Анастасия",
    "Сонастройка Латышева",
    "Сонастройка Лукина Юлия",
    "Тверческая мастерская",
    "Творческая мастерская",
    "Тьюторский час",
    "Физика",
    "Химия",
    "с 8.10",
    "тьюторский час"
];

export const AVAILABILITY_PRESETS = [
    {
        "label": "1 урок (10:50 - 11:35)",
        "start": "10:50",
        "end": "11:35"
    },
    {
        "label": "2 урок (11:30 - 11:45)",
        "start": "11:30",
        "end": "11:45"
    },
    {
        "label": "3 урок (11:45 - 12:30)",
        "start": "11:45",
        "end": "12:30"
    },
    {
        "label": "4 урок (12:40 - 13:25)",
        "start": "12:40",
        "end": "13:25"
    },
    {
        "label": "5 урок (13:35 - 14:20)",
        "start": "13:35",
        "end": "14:20"
    },
    {
        "label": "6 урок (14:00 - 14:45)",
        "start": "14:00",
        "end": "14:45"
    },
    {
        "label": "7 урок (14:30 - 15:15)",
        "start": "14:30",
        "end": "15:15"
    },
    {
        "label": "8 урок (15:25 - 16:10)",
        "start": "15:25",
        "end": "16:10"
    },
    {
        "label": "9 урок (15:30 - 16:30)",
        "start": "15:30",
        "end": "16:30"
    },
    {
        "label": "10 урок (16:00 - 17:00)",
        "start": "16:00",
        "end": "17:00"
    },
    {
        "label": "11 урок (16:30 - 17:30)",
        "start": "16:30",
        "end": "17:30"
    },
    {
        "label": "12 урок (17:00 - 18:00)",
        "start": "17:00",
        "end": "18:00"
    },
    {
        "label": "13 урок (8:45 - 9:00)",
        "start": "8:45",
        "end": "9:00"
    },
    {
        "label": "14 урок (9:00 - 9:45)",
        "start": "9:00",
        "end": "9:45"
    },
    {
        "label": "15 урок (9:55 - 10:40)",
        "start": "9:55",
        "end": "10:40"
    }
];

export const DEFAULT_WORKING_HOURS = {
    start: '2025-09-01',
    end: '2026-06-30',
    slots: []
};

export const GRADES = [
    'Начальная школа (1-4)',
    'Средняя школа (5-9)',
    'Старшая школа (10-11)'
];

export const TEACHERS = [
    {
        "id": 1,
        "name": "Бондарь Ольга",
        "subject": "Технология /ИЗО",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 2,
        "name": "Ерохина Анастасия",
        "subject": "Английский язык",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 3,
        "name": "Малкова Полина",
        "subject": "Английский язык",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 4,
        "name": "Козлова Галина",
        "subject": "Русский язык, Литература",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 5,
        "name": "Чеченкова Светлана",
        "subject": "Математика, окружающий мир",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 6,
        "name": "Савина Ксения",
        "subject": "Математика, окружающий мир",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 7,
        "name": "Абдуллаева Джамиля",
        "subject": "Русский язык, Литература",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 8,
        "name": "Петрова Елизавета",
        "subject": "Русский язык, Литература",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 9,
        "name": "Карабанова Маргарита",
        "subject": "Физкультура",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 10,
        "name": "Пашкова Анна",
        "subject": "Математика,окружающий мир",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 11,
        "name": "Конохов Павел",
        "subject": "Русский язык, Литература",
        "grades": [
            "Начальная школа (1-4)"
        ]
    },
    {
        "id": 12,
        "name": "Анастасия Вайнула",
        "subject": "Русский язык, Литература",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 13,
        "name": "Тенешева Дарья",
        "subject": "Русский язык, Литература",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 14,
        "name": "Мишина Валерия",
        "subject": "Русский язык, Литература",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 15,
        "name": "Ларшина Анастасия",
        "subject": "Алгебра, геометрия, информатика",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 16,
        "name": "Михайлова Марина",
        "subject": "Математика",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 17,
        "name": "Карнаушенко Оксана",
        "subject": "Математика",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 18,
        "name": "Павленко Ольга",
        "subject": "Биология",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 19,
        "name": "Четверикова Ксения",
        "subject": "Химия",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 20,
        "name": "Липко Владлена",
        "subject": "Физика",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 21,
        "name": "Павликов Дмитрий",
        "subject": "История, обществознание",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 22,
        "name": "Зиновьева Александра",
        "subject": "Английский язык",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 23,
        "name": "Латышева Ирина",
        "subject": "Английский язык",
        "grades": [
            "Средняя школа (5-9)"
        ]
    },
    {
        "id": 24,
        "name": "Гайденко Елена",
        "subject": "География",
        "grades": [
            "Средняя школа (5-9)"
        ]
    }
];

// Расписание из Excel (7-9 классы)
export const REAL_SCHEDULE = {
    "7А": {
        "Понедельник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "13:35-14:20",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "14:30-15:15",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "16:00-17:00",
                "subject": "Продленка",
                "teacher": "Лукина Юлия"
            },
            {
                "time": "17:00-18:00",
                "subject": "Тверческая мастерская",
                "teacher": "Лукина Юлия"
            },
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "13:35-14:20",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "14:30-15:15",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            }
        ],
        "Вторник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Ларшина Анастасия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "14:30-15:15",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "16:00-17:00",
                "subject": "Продленка",
                "teacher": "Лукина Юлия"
            },
            {
                "time": "17:00-18:00",
                "subject": "Тверческая мастерская",
                "teacher": "Лукина Юлия"
            },
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Ларшина Анастасия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "14:30-15:15",
                "subject": "Биология",
                "teacher": "Павленко"
            }
        ],
        "Среда": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "13:35-14:20",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "14:30-15:15",
                "subject": "Тьюторский час",
                "teacher": "Лукина"
            },
            {
                "time": "16:00-17:00",
                "subject": "Продленка",
                "teacher": "Лукина Юлия"
            },
            {
                "time": "17:00-18:00",
                "subject": "Тверческая мастерская",
                "teacher": "Лукина Юлия"
            },
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "13:35-14:20",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "14:30-15:15",
                "subject": "Тьюторский час",
                "teacher": "Лукина"
            }
        ],
        "Четверг": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "14:30-15:15",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "16:00-17:00",
                "subject": "Продленка",
                "teacher": "Лукина Юлия"
            },
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "14:30-15:15",
                "subject": "Физика",
                "teacher": "Барышникова"
            }
        ],
        "Пятница": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "14:30-15:15",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "15:25-16:10",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка Лукина Юлия",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "14:30-15:15",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "15:25-16:10",
                "subject": "Английский язык",
                "teacher": "Латышева"
            }
        ]
    },
    "7Б": {
        "Понедельник": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Карнаушенко"
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Карнаушенко"
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": "Карнаушенко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "11:45-12:30",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "15:30-16:30",
                "subject": "Продленка",
                "teacher": ""
            },
            {
                "time": "16:30-17:30",
                "subject": "Творческая мастерская",
                "teacher": "Лалетина"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "11:45-12:30",
                "subject": "Информатика",
                "teacher": "Ларшина"
            }
        ],
        "Вторник": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "9:55-10:40",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:45-12:30",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "16:30-17:30",
                "subject": "Творческая мастерская",
                "teacher": "Лалетина"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "9:55-10:40",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:45-12:30",
                "subject": "История",
                "teacher": "Павликов"
            }
        ],
        "Среда": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Карнаушенко"
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Карнаушенко"
            },
            {
                "time": "9:55-10:40",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:45-12:30",
                "subject": "Физика",
                "teacher": "Липко"
            },
            {
                "time": "16:30-17:30",
                "subject": "Творческая мастерская",
                "teacher": "Лалетина"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "9:00-9:45",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:45-12:30",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            }
        ],
        "Четверг": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Алгебра",
                "teacher": "Карнаушенко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Физика",
                "teacher": "Липко"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "9:55-10:40",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            }
        ],
        "Пятница": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Карнаушенко"
            },
            {
                "time": "9:00-9:45",
                "subject": "Геометрия",
                "teacher": "Карнаушенко"
            },
            {
                "time": "9:55-10:40",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "10:50-11:35",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "10:50-11:35",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            }
        ]
    },
    "8А": {
        "Понедельник": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Тенешева"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "16:00-17:00",
                "subject": "Продленка",
                "teacher": ""
            },
            {
                "time": "17:00-18:00",
                "subject": "Тверческая мастерская",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Русский язык",
                "teacher": ""
            },
            {
                "time": "9:55-10:40",
                "subject": "тьюторский час",
                "teacher": ""
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": ""
            },
            {
                "time": "12:40-13:25",
                "subject": "История",
                "teacher": ""
            }
        ],
        "Вторник": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка Ларшина",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Тенешева"
            },
            {
                "time": "11:45-12:30",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "17:00-18:00",
                "subject": "Тверческая мастерская",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Литература",
                "teacher": ""
            },
            {
                "time": "9:55-10:40",
                "subject": "Английский язык",
                "teacher": ""
            },
            {
                "time": "10:50-11:35",
                "subject": "Алгебра",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "География",
                "teacher": ""
            },
            {
                "time": "12:40-13:25",
                "subject": "Биология",
                "teacher": ""
            }
        ],
        "Среда": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "Химия",
                "teacher": "Четверикова"
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Тенешева"
            },
            {
                "time": "11:45-12:30",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "12:40-13:25",
                "subject": "Обществознание",
                "teacher": "Павликов"
            },
            {
                "time": "17:00-18:00",
                "subject": "Тверческая мастерская",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Химия",
                "teacher": ""
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": ""
            },
            {
                "time": "10:50-11:35",
                "subject": "География",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "История",
                "teacher": ""
            },
            {
                "time": "12:40-13:25",
                "subject": "Обществознание",
                "teacher": ""
            }
        ],
        "Четверг": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка Ларшина",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Физика",
                "teacher": "Липко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Тенешева"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": ""
            },
            {
                "time": "9:55-10:40",
                "subject": "Физика",
                "teacher": ""
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Алгебра",
                "teacher": ""
            }
        ],
        "Пятница": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка Латышева",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Тенешева"
            },
            {
                "time": "11:45-12:30",
                "subject": "Физика",
                "teacher": "Липко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Английский язык",
                "teacher": ""
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": ""
            },
            {
                "time": "10:50-11:35",
                "subject": "Информатика",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Физика",
                "teacher": ""
            }
        ]
    },
    "9А": {
        "Понедельник": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Павликов"
            },
            {
                "time": "9:00-9:45",
                "subject": "Обществознание",
                "teacher": "Павликов"
            },
            {
                "time": "9:55-10:40",
                "subject": "Русский язык",
                "teacher": "Тенешева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Тенешева"
            },
            {
                "time": "15:30-16:30",
                "subject": "Продленка",
                "teacher": ""
            },
            {
                "time": "16:30-17:30",
                "subject": "Тверческая мастерская",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Павликов"
            },
            {
                "time": "9:00-9:45",
                "subject": "Обществознание",
                "teacher": "Павликов"
            },
            {
                "time": "9:55-10:40",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Физика",
                "teacher": "Барышникова"
            }
        ],
        "Вторник": [
            {
                "time": "8:45-9:00",
                "subject": "Сонаcтройка Тенешева",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "Русский язык",
                "teacher": "Тенешева"
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "14:00-14:45",
                "subject": "С 7.10",
                "teacher": "ФАКУЛЬТАТИВ ОГЭ"
            },
            {
                "time": "16:30-17:30",
                "subject": "Тверческая мастерская",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонаcтройка Гайденко",
                "teacher": ""
            },
            {
                "time": "9:00-9:45",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Петрова"
            }
        ],
        "Среда": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Тенешева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Физика",
                "teacher": "Липко *"
            },
            {
                "time": "14:00-14:45",
                "subject": "с 8.10",
                "teacher": "ФАКУЛЬТАТИВ ОГЭ"
            },
            {
                "time": "16:30-17:30",
                "subject": "Тверческая мастерская",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Петрова"
            }
        ],
        "Четверг": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Латышева"
            },
            {
                "time": "9:00-9:45",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "9:55-10:40",
                "subject": "Русский язык",
                "teacher": "Тенешева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "14:00-14:45",
                "subject": "Со 2.10",
                "teacher": "ФАКУЛЬТАТИВ ОГЭ"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Латышева"
            },
            {
                "time": "9:00-9:45",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "9:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Биология",
                "teacher": "Павленко"
            }
        ],
        "Пятница": [
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "9:55-10:40",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Физика",
                "teacher": "Липко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Химия",
                "teacher": "Четверикова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Биология",
                "teacher": "Павленко*"
            },
            {
                "time": "14:00-14:45",
                "subject": "С 3.10",
                "teacher": "ФАКУЛЬТАТИВ ОГЭ"
            },
            {
                "time": "8:45-9:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина Елизавета"
            },
            {
                "time": "9:00-9:45",
                "subject": "Химия",
                "teacher": "Созонов"
            },
            {
                "time": "9:55-10:40",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            }
        ]
    }
};

// Mock Schedule для системы замен
export const MOCK_SCHEDULE = {
    'DEFAULT': {
        // Будет заполняться динамически из REAL_SCHEDULE
    }
};

export const getTeacherAvailability = (teacherId, date, lessonNumber) => {
    const dateKey = typeof date === 'string' ? date : 'DEFAULT';
    const daySchedule = MOCK_SCHEDULE[dateKey] || MOCK_SCHEDULE['DEFAULT'];

    if (!daySchedule) return true;

    const busyLessons = daySchedule[teacherId] || [];
    return !busyLessons.includes(parseInt(lessonNumber));
};

export const getTeacherWorkload = (teacherId, date) => {
    const dateKey = typeof date === 'string' ? date : 'DEFAULT';
    const daySchedule = MOCK_SCHEDULE[dateKey] || MOCK_SCHEDULE['DEFAULT'];

    if (!daySchedule) return 0;

    const busyLessons = daySchedule[teacherId] || [];
    return busyLessons.length;
};

export const INITIAL_SUBSTITUTIONS = [];
