// Mock Data for School Calendar - Обновлено из расписания 2025-2026 (автоимпорт из Excel)

export const SUBJECTS = [
    "Алгебра",
    "Английский язык",
    "Биология",
    "Русский язык (факультатив ОГЭ)",
    "География",
    "Геометрия",
    "Информатика",
    "История",
    "Литература",
    "Литературное чтение",
    "Математика",
    "Музыка",
    "Обществознание",
    "Окружающий мир",
    "Русский язык",
    "Сонастройка",
    "Технология",
    "Тьюторский час",
    "Физика",
    "Химия"
];

export const GRADES = [
    "Начальная школа (1-4)",
    "Средняя школа (5-9)"
];

export const AVAILABILITY_PRESETS = [
    { "label": "Сонастройка (08:45-09:00)", "start": "08:45", "end": "09:00" },
    { "label": "1 урок (09:00-09:45)", "start": "09:00", "end": "09:45" },
    { "label": "2 урок (09:55-10:40)", "start": "09:55", "end": "10:40" },
    { "label": "3 урок (10:50-11:35)", "start": "10:50", "end": "11:35" },
    { "label": "Сонастройка 2 (11:30-11:45)", "start": "11:30", "end": "11:45" },
    { "label": "4 урок (11:45-12:30)", "start": "11:45", "end": "12:30" },
    { "label": "5 урок (12:40-13:25)", "start": "12:40", "end": "13:25" },
    { "label": "6 урок (13:35-14:20)", "start": "13:35", "end": "14:20" },
    { "label": "7 урок (14:30-15:15)", "start": "14:30", "end": "15:15" },
    { "label": "8 урок (15:25-16:10)", "start": "15:25", "end": "16:10" }
];

export const CLASS_LIST = [
    "1А",
    "1Б",
    "2А",
    "2Б",
    "2В",
    "3А",
    "3Б",
    "3В",
    "4А",
    "4Б",
    "4В",
    "5А",
    "5Б",
    "5В",
    "6А",
    "6Б",
    "7А",
    "7Б",
    "8А",
    "9А"
];

export const TEACHERS = [
    {"id":1,"name":"Абдуллаева Джамиля","subject":"Русский язык, Литературное чтение, Литература","grades":["Начальная школа (1-4)"]},
    {"id":2,"name":"Алымова Анна","subject":"Не указан","grades":[]},
    {"id":3,"name":"Аношко","subject":"Не указан","grades":["Начальная школа (1-4)"]},
    {"id":4,"name":"Баранникова Лада","subject":"Не указан","grades":[]},
    {"id":5,"name":"Барышникова Дарья","subject":"Физика","grades":["Средняя школа (5-9)"]},
    {"id":6,"name":"Бондарь Ольга","subject":"Технология","grades":["Начальная школа (1-4)"]},
    {"id":7,"name":"Вайнула Анастасия","subject":"Русский язык, Литература","grades":["Средняя школа (5-9)"]},
    {"id":8,"name":"Гайденко Елена","subject":"География","grades":["Средняя школа (5-9)"]},
    {"id":9,"name":"Голубева","subject":"Не указан","grades":["Средняя школа (5-9)"]},
    {"id":10,"name":"Гусева Алеся","subject":"Не указан","grades":[]},
    {"id":11,"name":"Дутова Анна","subject":"Не указан","grades":[]},
    {"id":12,"name":"Ерохина Анастасия","subject":"Английский язык","grades":["Начальная школа (1-4)"]},
    {"id":13,"name":"Зиновьева Александра","subject":"Не указан","grades":[]},
    {"id":14,"name":"Карабанова Маргарита","subject":"Не указан","grades":[]},
    {"id":15,"name":"Карнаушенко Оксана","subject":"Не указан","grades":[]},
    {"id":16,"name":"Карпова Татьяна","subject":"Музыка","grades":["Начальная школа (1-4)"]},
    {"id":17,"name":"Ковалева Оксана","subject":"Не указан","grades":[]},
    {"id":18,"name":"Козлова Галина","subject":"Русский язык, Литература","grades":["Начальная школа (1-4)"],"lessonRate":0,"rates":[{"id":"rate-1","name":"Классы","rate":700},{"id":"rate-2","name":"Сонастройка","rate":160}]},
    {"id":19,"name":"Коломеец Екатерина","subject":"Обществознание","grades":["Средняя школа (5-9)"]},
    {"id":20,"name":"Коновалова","subject":"Не указан","grades":["Начальная школа (1-4)"]},
    {"id":21,"name":"Конохов Павел","subject":"Не указан","grades":[]},
    {"id":22,"name":"Куликова Арина","subject":"Не указан","grades":[]},
    {"id":23,"name":"Лалетина","subject":"Не указан","grades":["Средняя школа (5-9)"]},
    {"id":24,"name":"Ларшина Анастасия","subject":"Алгебра, Геометрия, Информатика, Математика","grades":["Средняя школа (5-9)"]},
    {"id":25,"name":"Латышева Ирина","subject":"Английский язык","grades":["Средняя школа (5-9)"]},
    {"id":26,"name":"Липко Владлена","subject":"Не указан","grades":[]},
    {"id":27,"name":"Лукина","subject":"Не указан","grades":["Средняя школа (5-9)"]},
    {"id":28,"name":"Малкова Полина","subject":"Английский язык","grades":["Начальная школа (1-4)"]},
    {"id":29,"name":"Матвеева Валерия","subject":"Английский язык","grades":["Средняя школа (5-9)"]},
    {"id":30,"name":"Михайлова Марина","subject":"Математика","grades":["Средняя школа (5-9)"]},
    {"id":31,"name":"Мишина Валерия","subject":"Русский язык, Литература","grades":["Средняя школа (5-9)"]},
    {"id":32,"name":"Назарова Анна","subject":"Не указан","grades":[]},
    {"id":33,"name":"Павленко Ольга","subject":"Биология","grades":["Средняя школа (5-9)"]},
    {"id":34,"name":"Павликов Дмитрий","subject":"История, Обществознание","grades":["Средняя школа (5-9)"]},
    {"id":35,"name":"Пашкова Анна","subject":"Русский язык, Литературное чтение, Математика, Окружающий мир","grades":["Начальная школа (1-4)"]},
    {"id":36,"name":"Петрова Елизавета","subject":"Литература, Русский язык, Русский язык (факультатив ОГЭ)","grades":["Начальная школа (1-4)","Средняя школа (5-9)"]},
    {"id":37,"name":"Рассолова","subject":"Не указан","grades":["Начальная школа (1-4)"]},
    {"id":38,"name":"Савина Ксения","subject":"Окружающий мир, Математика","grades":["Начальная школа (1-4)"]},
    {"id":39,"name":"Силосьева","subject":"Не указан","grades":["Начальная школа (1-4)","Средняя школа (5-9)"]},
    {"id":40,"name":"Скоринова Наталья","subject":"Математика","grades":["Средняя школа (5-9)"]},
    {"id":41,"name":"Смирнова Вероника","subject":"Не указан","grades":[]},
    {"id":42,"name":"Созонов","subject":"Химия","grades":["Средняя школа (5-9)"]},
    {"id":43,"name":"Созонова Никита","subject":"Не указан","grades":[]},
    {"id":44,"name":"Тенешева Дарья","subject":"Не указан","grades":[]},
    {"id":45,"name":"Тронина Ольга","subject":"Музыка","grades":["Начальная школа (1-4)"]},
    {"id":46,"name":"Цуркан","subject":"Не указан","grades":["Начальная школа (1-4)"]},
    {"id":47,"name":"Четверикова Ксения","subject":"Не указан","grades":[]},
    {"id":48,"name":"Чеченкова Светлана","subject":"Математика, Окружающий мир","grades":["Начальная школа (1-4)"]},
    {"id":49,"name":"Юманова Дарья","subject":"Не указан","grades":[]}
];

export const INITIAL_SUBSTITUTIONS = [];

// Расписание из Excel (1-9 классы) - обновлено 13.03.2026
export const REAL_SCHEDULE = {
    "1А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Пашкова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Пашкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Музыка",
                "teacher": "Карпова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Литературное чтение",
                "teacher": "Пашкова"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Пашкова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Пашкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Математика",
                "teacher": "Савина"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Тьюторский час",
                "teacher": "Коновалова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литературное чтение",
                "teacher": "Пашкова"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "09:55-10:40",
                "subject": "Математика",
                "teacher": "Савина"
            }
        ],
        "Суббота": []
    },
    "1Б": {
        "Понедельник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "13:35-14:20",
                "subject": "Музыка",
                "teacher": "Карпова"
            }
        ],
        "Вторник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Савина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Русский язык",
                "teacher": "Пашкова"
            }
        ],
        "Среда": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литературное чтение",
                "teacher": "Пашкова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Тьюторский час",
                "teacher": "Коновалова"
            }
        ],
        "Четверг": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Пашкова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            }
        ],
        "Пятница": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литературное чтение",
                "teacher": "Пашкова"
            }
        ],
        "Суббота": []
    },
    "2А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Музыка",
                "teacher": "Карпова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Пашкова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Пашкова"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Пашкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Силосьева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Литература",
                "teacher": "Козлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Пашкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Тьюторский час",
                "teacher": "Силосьева"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Литература",
                "teacher": "Козлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Пашкова"
            }
        ],
        "Суббота": []
    },
    "2Б": {
        "Понедельник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Тьюторский час",
                "teacher": "Коновалова"
            },
            {
                "time": "14:30-15:15",
                "subject": "Музыка",
                "teacher": "Карпова"
            }
        ],
        "Вторник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Ерохина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Литература",
                "teacher": "Козлова"
            }
        ],
        "Среда": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            }
        ],
        "Четверг": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Козлова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            }
        ],
        "Пятница": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "12:40-13:25",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Козлова"
            }
        ],
        "Суббота": []
    },
    "2В": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Пашкова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Музыка",
                "teacher": "Карпова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Окружающий мир",
                "teacher": "Пашкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Литературное чтение",
                "teacher": "Абдуллаева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Тьюторский час",
                "teacher": "Рассолова"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Пашкова"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литературное чтение",
                "teacher": "Абдуллаева"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Коновалова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Пашкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Пашкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Абдуллаева"
            }
        ],
        "Суббота": []
    },
    "3А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Силосьева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Козлова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Силосьева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Литература",
                "teacher": "Козлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Музыка",
                "teacher": "Тронина"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Силосьева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Литература",
                "teacher": "Козлова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Тьюторский час",
                "teacher": "Силосьева"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Козлова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Силосьева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            }
        ],
        "Суббота": []
    },
    "3Б": {
        "Понедельник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Тьюторский час",
                "teacher": "Аношко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "14:30-15:15",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            }
        ],
        "Вторник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Козлова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "13:35-14:20",
                "subject": "Музыка",
                "teacher": "Тронина"
            }
        ],
        "Среда": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Козлова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Окружающий мир",
                "teacher": "Савина"
            }
        ],
        "Четверг": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Савина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            }
        ],
        "Пятница": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Козлова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Математика",
                "teacher": "Савина"
            }
        ],
        "Суббота": []
    },
    "3В": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Тьюторский час",
                "teacher": "Аношко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Абдуллаева"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "09:00-09:45",
                "subject": "Музыка",
                "teacher": "Тронина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Чеченкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Абдуллаева"
            },
            {
                "time": "11:45-12:30",
                "subject": "Технология",
                "teacher": "Бондарь"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Абдуллаева"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "09:00-09:45",
                "subject": "Литература",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Чеченкова"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Аношко"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Абдуллаева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Чеченкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Ерохина"
            }
        ],
        "Суббота": []
    },
    "4А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "09:00-09:45",
                "subject": "Тьюторский час",
                "teacher": "Цуркан"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Чеченкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Чеченкова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Петрова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Музыка",
                "teacher": "Тронина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Петрова"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Окружающий мир",
                "teacher": "Чеченкова"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Математика",
                "teacher": "Чеченкова"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Петрова"
            }
        ],
        "Суббота": []
    },
    "4Б": {
        "Понедельник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "11:45-12:30",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "12:40-13:25",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Математика",
                "teacher": "Пашкова"
            }
        ],
        "Вторник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Пашкова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Музыка",
                "teacher": "Тронина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Литература",
                "teacher": "Петрова"
            }
        ],
        "Среда": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "11:45-12:30",
                "subject": "Окружающий мир",
                "teacher": "Пашкова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Петрова"
            }
        ],
        "Четверг": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Математика",
                "teacher": "Пашкова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Петрова"
            }
        ],
        "Пятница": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "11:45-12:30",
                "subject": "Окружающий мир",
                "teacher": "Пашкова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Литература",
                "teacher": "Петрова"
            },
            {
                "time": "14:30-15:15",
                "subject": "Тьюторский час",
                "teacher": "Цуркан"
            }
        ],
        "Суббота": []
    },
    "4В": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Малкова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Петрова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "09:00-09:45",
                "subject": "Тьюторский час",
                "teacher": "Цуркан"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Чеченкова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Музыка",
                "teacher": "Тронина"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Технология",
                "teacher": "Бондарь"
            },
            {
                "time": "09:55-10:40",
                "subject": "Окружающий мир",
                "teacher": "Чеченкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Петрова"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Цуркан"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Малкова"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:00-09:45",
                "subject": "Окружающий мир",
                "teacher": "Чеченкова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Малкова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Чеченкова"
            }
        ],
        "Суббота": []
    },
    "5А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Мишина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Литература",
                "teacher": "Мишина"
            },
            {
                "time": "10:50-11:35",
                "subject": "География",
                "teacher": "Гайденко"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Мишина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Тьюторский час",
                "teacher": "Силосьева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Мишина"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Мишина"
            },
            {
                "time": "09:55-10:40",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "10:50-11:35",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            }
        ],
        "Суббота": []
    },
    "5Б": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Мишина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Тьюторский час",
                "teacher": "Лукина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Литература",
                "teacher": "Мишина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Мишина"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            },
            {
                "time": "10:50-11:35",
                "subject": "История",
                "teacher": "Павликов"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Литература",
                "teacher": "Мишина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            },
            {
                "time": "10:50-11:35",
                "subject": "История",
                "teacher": "Павликов"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "09:55-10:40",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Мишина"
            }
        ],
        "Суббота": []
    },
    "5В": {
        "Понедельник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Мишина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "13:35-14:20",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            }
        ],
        "Вторник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Тьюторский час",
                "teacher": "Лукина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Литература",
                "teacher": "Мишина"
            }
        ],
        "Среда": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Мишина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "13:35-14:20",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "14:30-15:15",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            }
        ],
        "Четверг": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Мишина"
            },
            {
                "time": "11:45-12:30",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "12:40-13:25",
                "subject": "Русский язык",
                "teacher": "Мишина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Литература",
                "teacher": "Мишина"
            }
        ],
        "Пятница": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Михайлова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Михайлова"
            },
            {
                "time": "12:40-13:25",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "13:35-14:20",
                "subject": "Английский язык",
                "teacher": "Матвеева"
            }
        ],
        "Суббота": []
    },
    "6А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Вайнула"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "09:55-10:40",
                "subject": "Тьюторский час",
                "teacher": "Голубева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Скоринова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Вайнула"
            },
            {
                "time": "09:00-09:45",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "09:55-10:40",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Скоринова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Голубева"
            },
            {
                "time": "09:00-09:45",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Латышева"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Вайнула"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "09:55-10:40",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "10:50-11:35",
                "subject": "Математика",
                "teacher": "Скоринова"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Голубева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "11:45-12:30",
                "subject": "Биология",
                "teacher": "Павленко"
            }
        ],
        "Суббота": []
    },
    "6Б": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Голубева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Тьюторский час",
                "teacher": "Голубева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Голубева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "09:55-10:40",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "11:45-12:30",
                "subject": "Математика",
                "teacher": "Скоринова"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Математика",
                "teacher": "Скоринова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Вайнула"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Голубева"
            },
            {
                "time": "09:00-09:45",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "09:55-10:40",
                "subject": "Математика",
                "teacher": "Скоринова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Гайденко"
            },
            {
                "time": "09:00-09:45",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "09:55-10:40",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Биология",
                "teacher": "Павленко"
            }
        ],
        "Суббота": []
    },
    "7А": {
        "Понедельник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "13:35-14:20",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "14:30-15:15",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            }
        ],
        "Вторник": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Павленко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "14:30-15:15",
                "subject": "Биология",
                "teacher": "Павленко"
            }
        ],
        "Среда": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "13:35-14:20",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "14:30-15:15",
                "subject": "Тьюторский час",
                "teacher": "Лукина"
            }
        ],
        "Четверг": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "14:30-15:15",
                "subject": "Физика",
                "teacher": "Барышникова"
            }
        ],
        "Пятница": [
            {
                "time": "11:30-11:45",
                "subject": "Сонастройка",
                "teacher": "Лукина"
            },
            {
                "time": "11:45-12:30",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "13:35-14:20",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "14:30-15:15",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "15:25-16:10",
                "subject": "Английский язык",
                "teacher": "Латышева"
            }
        ],
        "Суббота": []
    },
    "7Б": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "11:45-12:30",
                "subject": "Информатика",
                "teacher": "Ларшина"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина"
            },
            {
                "time": "09:00-09:45",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "09:55-10:40",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:45-12:30",
                "subject": "История",
                "teacher": "Павликов"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": ""
            },
            {
                "time": "09:00-09:45",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "11:45-12:30",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "10:50-11:35",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Вайнула"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "10:50-11:35",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            }
        ],
        "Суббота": []
    },
    "8А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "12:40-13:25",
                "subject": "История",
                "teacher": "Павликов"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "10:50-11:35",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Вайнула"
            },
            {
                "time": "12:40-13:25",
                "subject": "Биология",
                "teacher": "Павленко"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "09:55-10:40",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "10:50-11:35",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "12:40-13:25",
                "subject": "Обществознание",
                "teacher": "Павликов"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            },
            {
                "time": "10:50-11:35",
                "subject": "Литература",
                "teacher": "Вайнула"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Латышева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Химия",
                "teacher": "Созонов"
            },
            {
                "time": "11:45-12:30",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "12:40-13:25",
                "subject": "Русский язык",
                "teacher": "Вайнула"
            }
        ],
        "Суббота": []
    },
    "9А": {
        "Понедельник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Павликов"
            },
            {
                "time": "09:00-09:45",
                "subject": "Обществознание",
                "teacher": "Павликов"
            },
            {
                "time": "09:55-10:40",
                "subject": "Тьюторский час",
                "teacher": "Лалетина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "14:00-14:45",
                "subject": "Русский язык (факультатив ОГЭ)",
                "teacher": "Петрова"
            }
        ],
        "Вторник": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Гайденко"
            },
            {
                "time": "09:00-09:45",
                "subject": "География",
                "teacher": "Гайденко"
            },
            {
                "time": "09:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "История",
                "teacher": "Павликов"
            },
            {
                "time": "11:45-12:30",
                "subject": "Литература",
                "teacher": "Петрова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "14:00-14:45",
                "subject": "Математика",
                "teacher": "Ларшина"
            }
        ],
        "Среда": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Ларшина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "09:55-10:40",
                "subject": "Информатика",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "14:00-14:45",
                "subject": "Обществознание",
                "teacher": "Коломеец"
            }
        ],
        "Четверг": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Латышева"
            },
            {
                "time": "09:00-09:45",
                "subject": "Английский язык",
                "teacher": "Латышева"
            },
            {
                "time": "09:55-10:40",
                "subject": "Геометрия",
                "teacher": "Ларшина"
            },
            {
                "time": "10:50-11:35",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "11:45-12:30",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "12:40-13:25",
                "subject": "Литература",
                "teacher": "Петрова"
            }
        ],
        "Пятница": [
            {
                "time": "08:45-09:00",
                "subject": "Сонастройка",
                "teacher": "Лалетина"
            },
            {
                "time": "09:00-09:45",
                "subject": "Химия",
                "teacher": "Созонов"
            },
            {
                "time": "09:55-10:40",
                "subject": "Русский язык",
                "teacher": "Петрова"
            },
            {
                "time": "10:50-11:35",
                "subject": "Алгебра",
                "teacher": "Ларшина"
            },
            {
                "time": "11:45-12:30",
                "subject": "Физика",
                "teacher": "Барышникова"
            },
            {
                "time": "12:40-13:25",
                "subject": "Биология",
                "teacher": "Павленко"
            },
            {
                "time": "14:00-14:45",
                "subject": "Биология",
                "teacher": "Павленко"
            }
        ],
        "Суббота": []
    }
};
